"""По данному целому неотрицательному n вычислите значение n!. N! = 1 * 2 * 3 * … * N (произведение всех чисел от 1 до N) 0! = 1 Решить задачу используя цикл while
Input: 5
Output: 120

n = int(input("Введите целое неотрицательное число:"))
if n>0: 
    z = n 
    while n > 1:
        z *=n-1
        n -= 1
print (z)

Дано натуральное число A > 1. Определите, каким по
счету числом Фибоначчи оно является, то есть
выведите такое число n, что φ(n)=A. Если А не
является числом Фибоначчи, выведите число -1.
Input: 5
Output: 6 

a = int(input("Введите натуральное число:"))
c, d = 0, 1
n = 1

while c < a:
    c,d = c+d,c
    n +=1

if c==a:
    print(n)
else:
    print(-1)

Уставшие от необычно теплой зимы, жители решили узнать, действительно ли это самая длинная оттепель за всю историю наблюдений за погодой. Они обратились к синоптикам, а те, в свою очередь, занялись исследованиями статистики за прошлые годы. Их интересует, сколько дней длилась самая длинная оттепель. Оттепелью они называют период, в который среднесуточная температура ежедневно превышала 0 градусов Цельсия. Напишите программу, помогающую синоптикам в работе.
Пользователь вводит число N – общее количество рассматриваемых дней (1 ≤ N ≤ 100). В следующих строках располагается N целых чисел.
Каждое число – среднесуточная температура в соответствующий день. Температуры – целые числа и лежат в диапазоне от –50 до 50

Input: 6 -> -20 30 -40 50 10 -10
Output: 2

n = int(input("Введите количество дней:"))
#if 1 <= n <= 100:
temp = 0
max1 = 0
for i in range(n):
    t = int(input())
    if t > 0:
         temp +=1
         if max1 < temp:
             max1 = temp
    else:
        temp = 0
print(max1)

Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя, а другой для тещи. Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче. Но вот незадача: арбузов слишком много и он не знает как же выбрать самый легкий и самый тяжелый арбуз? Помогите ему!
Пользователь вводит одно число N – количество арбузов. Вторая строка содержит N чисел, записанных на новой строчке каждое. Здесь каждое число – это масса соответствующего арбуза
Input: 5 -> 5 1 6 5 9
Output: 1 9"""
n = int(input("Введите количество арбузов:"))
heav = 0
import math
light = math.inf

for i in range(n):
    m = int(input())
    if m > heav:
        heav = m
    if m < light:
        light = m
print(light, heav)



